garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnDSAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnDSAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x49">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="DSA" edc:mask="0xff" edc:name="DSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="DSA8" edc:mask="0x1" edc:name="DSA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA9" edc:mask="0x1" edc:name="DSA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA10" edc:mask="0x1" edc:name="DSA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA11" edc:mask="0x1" edc:name="DSA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA12" edc:mask="0x1" edc:name="DSA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA13" edc:mask="0x1" edc:name="DSA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA14" edc:mask="0x1" edc:name="DSA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="DSA15" edc:mask="0x1" edc:name="DSA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSCNT" edc:desc="DMA source count register" edc:name="DMAnSCNT" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4A">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSCNTL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSCNTL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4A">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SCNT" edc:mask="0xff" edc:name="SCNT" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SCNT0" edc:mask="0x1" edc:name="SCNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT1" edc:mask="0x1" edc:name="SCNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT2" edc:mask="0x1" edc:name="SCNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT3" edc:mask="0x1" edc:name="SCNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT4" edc:mask="0x1" edc:name="SCNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT5" edc:mask="0x1" edc:name="SCNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT6" edc:mask="0x1" edc:name="SCNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT7" edc:mask="0x1" edc:name="SCNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnSCNTH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnSCNTH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4B">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SCNT" edc:mask="0xf" edc:name="SCNT" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SCNT8" edc:mask="0x1" edc:name="SCNT8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT9" edc:mask="0x1" edc:name="SCNT9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT10" edc:mask="0x1" edc:name="SCNT10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SCNT11" edc:mask="0x1" edc:name="SCNT11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSPTR" edc:desc="DMA source pointer register" edc:name="DMAnSPTR" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4C">
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnSPTRL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSPTRL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4C">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPTR" edc:mask="0xff" edc:name="SPTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SPTR0" edc:mask="0x1" edc:name="SPTR0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR1" edc:mask="0x1" edc:name="SPTR1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR2" edc:mask="0x1" edc:name="SPTR2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR3" edc:mask="0x1" edc:name="SPTR3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR4" edc:mask="0x1" edc:name="SPTR4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR5" edc:mask="0x1" edc:name="SPTR5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR6" edc:mask="0x1" edc:name="SPTR6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR7" edc:mask="0x1" edc:name="SPTR7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="DMAnSPTRH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSPTRH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPTR" edc:mask="0xff" edc:name="SPTR" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SPTR8" edc:mask="0x1" edc:name="SPTR8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR9" edc:mask="0x1" edc:name="SPTR9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR10" edc:mask="0x1" edc:name="SPTR10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR11" edc:mask="0x1" edc:name="SPTR11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR12" edc:mask="0x1" edc:name="SPTR12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR13" edc:mask="0x1" edc:name="SPTR13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR14" edc:mask="0x1" edc:name="SPTR14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR15" edc:mask="0x1" edc:name="SPTR15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="--rrrrrr" edc:cname="DMAnSPTRU" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--000000" edc:name="DMAnSPTRU" edc:nzwidth="8" edc:por="--000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SPTR" edc:mask="0x3f" edc:name="SPTR" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SPTR16" edc:mask="0x1" edc:name="SPTR16" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR17" edc:mask="0x1" edc:name="SPTR17" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR18" edc:mask="0x1" edc:name="SPTR18" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR19" edc:mask="0x1" edc:name="SPTR19" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR20" edc:mask="0x1" edc:name="SPTR20" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SPTR21" edc:mask="0x1" edc:name="SPTR21" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSSZ" edc:desc="DMA source size register" edc:name="DMAnSSZ" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4F">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSZL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSZL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x4F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSZ" edc:mask="0xff" edc:name="SSZ" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SSZ0" edc:mask="0x1" edc:name="SSZ0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ1" edc:mask="0x1" edc:name="SSZ1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ2" edc:mask="0x1" edc:name="SSZ2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ3" edc:mask="0x1" edc:name="SSZ3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ4" edc:mask="0x1" edc:name="SSZ4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ5" edc:mask="0x1" edc:name="SSZ5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ6" edc:mask="0x1" edc:name="SSZ6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ7" edc:mask="0x1" edc:name="SSZ7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="----nnnn" edc:cname="DMAnSSZH" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="DMAnSSZH" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x50">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSZ" edc:mask="0xf" edc:name="SSZ" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="SSZ8" edc:mask="0x1" edc:name="SSZ8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ9" edc:mask="0x1" edc:name="SSZ9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ10" edc:mask="0x1" edc:name="SSZ10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSZ11" edc:mask="0x1" edc:name="SSZ11" edc:nzwidth="0x1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
                <edc:AdjustPoint edc:offset="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="DMAnSSA" edc:desc="DMA source address register" edc:name="DMAnSSA" edc:nzwidth="0x10" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x51">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x51">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA0" edc:mask="0x1" edc:name="SSA0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA1" edc:mask="0x1" edc:name="SSA1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA2" edc:mask="0x1" edc:name="SSA2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA3" edc:mask="0x1" edc:name="SSA3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA4" edc:mask="0x1" edc:name="SSA4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA5" edc:mask="0x1" edc:name="SSA5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA6" edc:mask="0x1" edc:name="SSA6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA7" edc:mask="0x1" edc:name="SSA7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="DMAnSSAH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="DMAnSSAH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03034_dma_8bit_v1_overlaid.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x18" edc:_addr="0x52">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="SSA" edc:mask="0xff" edc:name="SSA" edc:nzwidth="0x8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="SSA8" edc:mask="0x1" edc:name="SSA8" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA9" edc:mask="0x1" edc:name="SSA9" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA10" edc:mask="0x1" edc:name="SSA10" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA11" edc:mask="0x1" edc:name="SSA11" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA12" edc:mask="0x1" edc:name="SSA12" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA13" edc:mask="0x1" edc:name="SSA13" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA14" edc:mask="0x1" edc:name="SSA14" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="SSA15" edc:mask="0x1" edc:name="SSA15" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
