garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:SFRDef edc:access="nnn--nnn" edc:cname="SCANCON0" edc:desc="" edc:impl="0xe7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000--100" edc:name="SCANCON0" edc:nzwidth="8" edc:por="000--100" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BUSY" edc:mask="0x1" edc:name="BUSY" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BURSTMD" edc:mask="0x1" edc:name="BURSTMD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MREG" edc:mask="0x1" edc:name="MREG" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="SGO" edc:desc="" edc:mask="0x1" edc:name="SGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRIGEN" edc:desc="" edc:mask="0x1" edc:name="TRIGEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x7"/>
              <edc:SFRFieldDef edc:cname="SCANEN" edc:mask="0x1" edc:name="SCANEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="SCANTRIG" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="SCANTRIG" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03165_nvm_scan_8bit_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x8" edc:_addr="0x72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TSEL" edc:desc="" edc:mask="0xf" edc:name="TSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TSEL0" edc:desc="" edc:mask="0x1" edc:name="TSEL0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL1" edc:desc="" edc:mask="0x1" edc:name="TSEL1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL2" edc:desc="" edc:mask="0x1" edc:name="TSEL2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TSEL3" edc:desc="" edc:mask="0x1" edc:name="TSEL3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="SCANTSEL" edc:desc="" edc:mask="0xf" edc:name="SCANTSEL" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n------r" edc:cname="BORCON" edc:desc="" edc:impl="0x81" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u------u" edc:name="BORCON" edc:nzwidth="8" edc:por="1------q" edc:_addr="0x73">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BORRDY" edc:mask="0x1" edc:name="BORRDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="SBOREN" edc:mask="0x1" edc:name="SBOREN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn" edc:cname="WDTCON0" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qqqqq0" edc:name="WDTCON0" edc:nzwidth="8" edc:por="--qqqqq0" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SEN" edc:desc="" edc:mask="0x1" edc:name="SEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS" edc:desc="" edc:mask="0x1f" edc:name="PS" edc:nzwidth="5"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS" edc:desc="" edc:mask="0x1f" edc:name="WDTPS" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTSEN" edc:desc="" edc:mask="0x1" edc:name="WDTSEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PS0" edc:desc="" edc:mask="0x1" edc:name="PS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS1" edc:desc="" edc:mask="0x1" edc:name="PS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS2" edc:desc="" edc:mask="0x1" edc:name="PS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS3" edc:desc="" edc:mask="0x1" edc:name="PS3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PS4" edc:desc="" edc:mask="0x1" edc:name="PS4" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS0" edc:desc="" edc:mask="0x1" edc:name="WDTPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS1" edc:desc="" edc:mask="0x1" edc:name="WDTPS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS2" edc:desc="" edc:mask="0x1" edc:name="WDTPS2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS3" edc:desc="" edc:mask="0x1" edc:name="WDTPS3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPS4" edc:desc="" edc:mask="0x1" edc:name="WDTPS4" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn-nnn" edc:cname="WDTCON1" edc:desc="" edc:impl="0x77" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-qqq-qqq" edc:name="WDTCON1" edc:nzwidth="8" edc:por="-qqq-qqq" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x75">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WINDOW" edc:desc="" edc:mask="0x7" edc:name="WINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CS" edc:desc="" edc:mask="0x7" edc:name="CS" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WINDOW0" edc:desc="" edc:mask="0x1" edc:name="WINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW1" edc:desc="" edc:mask="0x1" edc:name="WINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WINDOW2" edc:desc="" edc:mask="0x1" edc:name="WINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS" edc:desc="" edc:mask="0x7" edc:name="WDTCS" edc:nzwidth="3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="WDTWINDOW" edc:desc="" edc:mask="0x7" edc:name="WDTWINDOW" edc:nzwidth="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CS0" edc:desc="" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:desc="" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:desc="" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:SFRFieldDef edc:cname="WDTWINDOW0" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW1" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTWINDOW2" edc:desc="" edc:mask="0x1" edc:name="WDTWINDOW2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS0" edc:desc="" edc:mask="0x1" edc:name="WDTCS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS1" edc:desc="" edc:mask="0x1" edc:name="WDTCS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTCS2" edc:desc="" edc:mask="0x1" edc:name="WDTCS2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="WDTPS" edc:desc="" edc:name="WDTPS" edc:nzwidth="0x10" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x76">
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSL" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x76">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PSCNTL" edc:desc="" edc:mask="0xff" edc:name="PSCNTL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="WDTPSCNTL" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNTL" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PSCNT0" edc:desc="" edc:mask="0x1" edc:name="PSCNT0" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT1" edc:desc="" edc:mask="0x1" edc:name="PSCNT1" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT2" edc:desc="" edc:mask="0x1" edc:name="PSCNT2" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT3" edc:desc="" edc:mask="0x1" edc:name="PSCNT3" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT4" edc:desc="" edc:mask="0x1" edc:name="PSCNT4" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT5" edc:desc="" edc:mask="0x1" edc:name="PSCNT5" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT6" edc:desc="" edc:mask="0x1" edc:name="PSCNT6" edc:nzwidth="0x1"/>
                <edc:SFRFieldDef edc:cname="PSCNT7" edc:desc="" edc:mask="0x1" edc:name="PSCNT7" edc:nzwidth="0x1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTPSH" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTPSH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x77">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="PSCNTH" edc:desc="" edc:mask="0xff" edc:name="PSCNTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.0">
                <edc:SFRFieldDef edc:cname="WDTPSCNTH" edc:desc="" edc:mask="0xff" edc:name="WDTPSCNTH" edc:nzwidth="8"/>
              </edc:SFRMode>
              <edc:SFRMode edc:id="LT.1">
                <edc:SFRFieldDef edc:cname="PSCNT8" edc:desc="" edc:mask="0x1" edc:name="PSCNT8" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT9" edc:desc="" edc:mask="0x1" edc:name="PSCNT9" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT10" edc:desc="" edc:mask="0x1" edc:name="PSCNT10" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT11" edc:desc="" edc:mask="0x1" edc:name="PSCNT11" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT12" edc:desc="" edc:mask="0x1" edc:name="PSCNT12" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT13" edc:desc="" edc:mask="0x1" edc:name="PSCNT13" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT14" edc:desc="" edc:mask="0x1" edc:name="PSCNT14" edc:nzwidth="1"/>
                <edc:SFRFieldDef edc:cname="PSCNT15" edc:desc="" edc:mask="0x1" edc:name="PSCNT15" edc:nzwidth="1"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="WDTTMR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="WDTTMR" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02448_wdt_windowed_v1_generic.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x5" edc:_addr="0x78">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PSCNT16" edc:desc="" edc:mask="0x1" edc:name="PSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PSCNT17" edc:desc="" edc:mask="0x1" edc:name="PSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STATE" edc:desc="" edc:mask="0x1" edc:name="STATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TMR" edc:desc="" edc:mask="0x1f" edc:name="TMR" edc:nzwidth="5"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WDTPSCNT16" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTPSCNT17" edc:desc="" edc:mask="0x1" edc:name="WDTPSCNT17" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTSTATE" edc:desc="" edc:mask="0x1" edc:name="WDTSTATE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR0" edc:desc="" edc:mask="0x1" edc:name="WDTTMR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR1" edc:desc="" edc:mask="0x1" edc:name="WDTTMR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR2" edc:desc="" edc:mask="0x1" edc:name="WDTTMR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR3" edc:desc="" edc:mask="0x1" edc:name="WDTTMR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WDTTMR4" edc:desc="" edc:mask="0x1" edc:name="WDTTMR4" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="WDTTMR" edc:desc="" edc:mask="0x1f" edc:name="WDTTMR" edc:nzwidth="5"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rr--nn" edc:cname="VREGCON" edc:desc="" edc:impl="0x33" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--qq--10" edc:name="VREGCON" edc:nzwidth="8" edc:por="--qq--10" edc:_addr="0x79">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="VREGPM" edc:mask="0x3" edc:name="VREGPM" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS" edc:mask="0x3" edc:name="PMSYS" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="VREGPM0" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VREGPM1" edc:mask="0x1" edc:name="VREGPM0" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="PMSYS0" edc:mask="0x1" edc:name="PMSYS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PMSYS1" edc:mask="0x1" edc:name="PMSYS1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnnnnnn" edc:cname="OSCCON1" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON1" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x7A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="NDIV" edc:mask="0xf" edc:name="NDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:mask="0x7" edc:name="NOSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="NDIV0" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV1" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV2" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NDIV3" edc:mask="0x1" edc:name="NDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOSC2" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="OSCCON2" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="OSCCON2" edc:nzwidth="8" edc:por="-0000000" edc:_addr="0x7B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CDIV" edc:mask="0xf" edc:name="CDIV" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:mask="0x7" edc:name="COSC" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CDIV0" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV1" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV2" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CDIV3" edc:mask="0x1" edc:name="CDIV0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="COSC2" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-rr---" edc:cname="OSCCON3" edc:desc="" edc:impl="0xd8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01-00---" edc:name="OSCCON3" edc:nzwidth="8" edc:por="01-00---" edc:_addr="0x7C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOSCR" edc:mask="0x1" edc:name="NOSCR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ORDY" edc:mask="0x1" edc:name="ORDY" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="SOSCPWR" edc:mask="0x1" edc:name="SOSCPWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSWHOLD" edc:mask="0x1" edc:name="CSWHOLD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
