garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="I3C1EC" edc:desc="I3C EVENT COMMANDS REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00001001" edc:name="I3C1EC" edc:nzwidth="8" edc:por="00001001" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIEN" edc:mask="0x1" edc:name="IBIEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EC2" edc:mask="0x1" edc:name="EC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="HJEN" edc:mask="0x1" edc:name="HJEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EC_7_4" edc:mask="0xf" edc:name="EC_7_4" edc:nzwidth="4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:JoinedSFRDef edc:cname="I3C1MWL" edc:desc="I3C MAXIMUM WRITE LENGTH" edc:name="I3C1MWL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9D">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MWLL" edc:desc="I3C MAXIMUM WRITE LENGTH LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MWLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9D">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MWLL" edc:mask="0xff" edc:name="MWLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MWLH" edc:desc="I3C MAXIMUM WRITE LENGTH HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MWLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9E">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MWLH" edc:mask="0xff" edc:name="MWLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:JoinedSFRDef edc:cname="I3C1MRL" edc:desc="I3C MAXIMUM READ LENGTH" edc:name="I3C1MRL" edc:nzwidth="0x10" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9F">
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRLL" edc:desc="I3C MAXIMUM READ LENGTH LOW BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRLL" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0x9F">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRLL" edc:mask="0xff" edc:name="MRLL" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1MRLH" edc:desc="I3C MAXIMUM READ LENGTH HIGH BYTE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1MRLH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA0">
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="MRLH" edc:mask="0xff" edc:name="MRLH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1IBIPSZ" edc:desc="I3C IN-BAND INTERRUPT PAYLOAD SIZE REGISTER" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1IBIPSZ" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA1">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IBIPSZ" edc:mask="0xff" edc:name="IBIPSZ" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID0" edc:desc="I3C PROVISIONAL ID REGISTER 0" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA2">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID0" edc:mask="0x1" edc:name="PID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID1" edc:mask="0x1" edc:name="PID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID2" edc:mask="0x1" edc:name="PID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID3" edc:mask="0x1" edc:name="PID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID4" edc:mask="0x1" edc:name="PID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID5" edc:mask="0x1" edc:name="PID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID6" edc:mask="0x1" edc:name="PID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID7" edc:mask="0x1" edc:name="PID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_7_0" edc:mask="0xff" edc:name="PID_7_0" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="I3C1PID1" edc:desc="I3C PROVISIONAL ID REGISTER 1" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="I3C1PID1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-05205_i3c_8bit_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x33" edc:_addr="0xA3">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PID8" edc:mask="0x1" edc:name="PID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PID9" edc:mask="0x1" edc:name="PID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID10" edc:mask="0x1" edc:name="PID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID11" edc:mask="0x1" edc:name="PID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID12" edc:mask="0x1" edc:name="PID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID13" edc:mask="0x1" edc:name="PID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID14" edc:mask="0x1" edc:name="PID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PID15" edc:mask="0x1" edc:name="PID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PID_11_8" edc:mask="0xf" edc:name="PID_11_8" edc:nzwidth="0x4"/>
              <edc:SFRFieldDef edc:cname="PID_15_12" edc:mask="0xf" edc:name="PID_15_12" edc:nzwidth="0x4"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
