garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TMR1H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="TMR1H" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x108">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR1H" edc:mask="0xff" edc:name="TMR1H" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1H0" edc:mask="0x1" edc:name="TMR1H0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H1" edc:mask="0x1" edc:name="TMR1H1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H2" edc:mask="0x1" edc:name="TMR1H2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H3" edc:mask="0x1" edc:name="TMR1H3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H4" edc:mask="0x1" edc:name="TMR1H4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H5" edc:mask="0x1" edc:name="TMR1H5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H6" edc:mask="0x1" edc:name="TMR1H6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1H7" edc:mask="0x1" edc:name="TMR1H7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="TMR18" edc:mask="0x1" edc:name="TMR18" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR19" edc:mask="0x1" edc:name="TMR19" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR110" edc:mask="0x1" edc:name="TMR110" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR111" edc:mask="0x1" edc:name="TMR111" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR112" edc:mask="0x1" edc:name="TMR112" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR113" edc:mask="0x1" edc:name="TMR113" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR114" edc:mask="0x1" edc:name="TMR114" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR115" edc:mask="0x1" edc:name="TMR115" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nn-nnn" edc:cname="T1CON" edc:desc="" edc:impl="0x37" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uu-u0u" edc:name="T1CON" edc:nzwidth="8" edc:por="--00-000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x109">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1CON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RD16" edc:desc="" edc:mask="0x1" edc:name="RD16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOT_SYNC" edc:desc="" edc:mask="0x1" edc:name="NOT_SYNC" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CKPS" edc:desc="" edc:mask="0x3" edc:name="CKPS" edc:nzwidth="2"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TMR1ON" edc:mask="0x1" edc:name="TMR1ON" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1RD16" edc:mask="0x1" edc:name="T1RD16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NOT_T1SYNC" edc:mask="0x1" edc:name="NOT_T1SYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS0" edc:desc="" edc:mask="0x1" edc:name="T1CKPS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKPS1" edc:desc="" edc:mask="0x1" edc:name="T1CKPS1" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nSYNC" edc:mask="0x1" edc:name="nSYNC" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS0" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CKPS1" edc:mask="0x1" edc:name="CKPS0" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RD161" edc:desc="" edc:mask="0x1" edc:name="RD161" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="nT1SYNC" edc:mask="0x1" edc:name="nT1SYNC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnr--" edc:cname="T1GCON" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuux--" edc:name="T1GCON" edc:nzwidth="8" edc:por="00000x--" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x10A">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1GCON"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="GVAL" edc:desc="" edc:mask="0x1" edc:name="GVAL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GGO" edc:desc="" edc:mask="0x1" edc:name="GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GSPM" edc:desc="" edc:mask="0x1" edc:name="GSPM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GTM" edc:desc="" edc:mask="0x1" edc:name="GTM" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GPOL" edc:desc="" edc:mask="0x1" edc:name="GPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="GE" edc:desc="" edc:mask="0x1" edc:name="GE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="T1GVAL" edc:mask="0x1" edc:name="T1GVAL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GGO" edc:desc="" edc:mask="0x1" edc:name="T1GGO" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1GSPM" edc:mask="0x1" edc:name="T1GSPM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GTM" edc:mask="0x1" edc:name="T1GTM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GPOL" edc:mask="0x1" edc:name="T1GPOL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GE" edc:mask="0x1" edc:name="T1GE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_DONE" edc:mask="0x1" edc:name="NOT_DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="NOT_T1DONE" edc:mask="0x1" edc:name="NOT_T1DONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.3">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="GGO_nDONE" edc:mask="0x1" edc:name="GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.4">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="T1GGO_nDONE" edc:mask="0x1" edc:name="T1GGO_nDONE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T1GATE" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="T1GATE" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x10B">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1GATE"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="GSS" edc:mask="0xf" edc:name="GSS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="GSS0" edc:mask="0x1" edc:name="GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS1" edc:mask="0x1" edc:name="GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS2" edc:mask="0x1" edc:name="GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="GSS3" edc:mask="0x1" edc:name="GSS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="T1GSS0" edc:mask="0x1" edc:name="T1GSS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS1" edc:mask="0x1" edc:name="T1GSS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS2" edc:mask="0x1" edc:name="T1GSS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1GSS3" edc:mask="0x1" edc:name="T1GSS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="T1CLK" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----uuuu" edc:name="T1CLK" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-02655_tmr_mid1_v6_8bit_rev2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x6" edc:_addr="0x10C">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TMR1CLK"/>
            <edc:LegacyAlias edc:cname="PR1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CS" edc:mask="0xf" edc:name="CS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T1CS0" edc:mask="0x1" edc:name="T1CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS1" edc:mask="0x1" edc:name="T1CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS2" edc:mask="0x1" edc:name="T1CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="T1CS3" edc:mask="0x1" edc:name="T1CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CS0" edc:mask="0x1" edc:name="CS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS1" edc:mask="0x1" edc:name="CS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS2" edc:mask="0x1" edc:name="CS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CS3" edc:mask="0x1" edc:name="CS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
