garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="CCPR2H" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="CCPR2H" edc:nzwidth="8" edc:por="xxxxxxxx" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x14E">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="RH" edc:desc="" edc:mask="0xff" edc:name="RH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="n-rnnnnn" edc:cname="CCP2CON" edc:desc="" edc:impl="0xbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-000000" edc:name="CCP2CON" edc:nzwidth="8" edc:por="0-000000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x14F">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MODE" edc:desc="" edc:mask="0xf" edc:name="MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="FMT" edc:desc="" edc:mask="0x1" edc:name="FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OUT" edc:desc="" edc:mask="0x1" edc:name="OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EN" edc:desc="" edc:mask="0x1" edc:name="EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="MODE0" edc:desc="" edc:mask="0x1" edc:name="MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE1" edc:desc="" edc:mask="0x1" edc:name="MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE2" edc:desc="" edc:mask="0x1" edc:name="MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="MODE3" edc:desc="" edc:mask="0x1" edc:name="MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2MODE" edc:desc="" edc:mask="0xf" edc:name="CCP2MODE" edc:nzwidth="4"/>
              <edc:SFRFieldDef edc:cname="CCP2FMT" edc:desc="" edc:mask="0x1" edc:name="CCP2FMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2OUT" edc:desc="" edc:mask="0x1" edc:name="CCP2OUT" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CCP2EN" edc:desc="" edc:mask="0x1" edc:name="CCP2EN" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2MODE0" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE1" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE2" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2MODE3" edc:desc="" edc:mask="0x1" edc:name="CCP2MODE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----nnn" edc:cname="CCP2CAP" edc:desc="" edc:impl="0x7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----000" edc:name="CCP2CAP" edc:nzwidth="8" edc:por="-----000" edc:_modsrc="DOS-02493_ccp_v4.Module" edc:_refcount="2" edc:_begin="0x0" edc:_end="0x4" edc:_addr="0x150">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CTS" edc:desc="" edc:mask="0x7" edc:name="CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="DS.1">
              <edc:SFRFieldDef edc:cname="CTS0" edc:desc="" edc:mask="0x1" edc:name="CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS1" edc:desc="" edc:mask="0x1" edc:name="CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CTS2" edc:desc="" edc:mask="0x1" edc:name="CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="CCP2CTS" edc:desc="" edc:mask="0x7" edc:name="CCP2CTS" edc:nzwidth="8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="CCP2CTS0" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS1" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CCP2CTS2" edc:desc="" edc:mask="0x1" edc:name="CCP2CTS2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWMLOAD" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWMLOAD" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_pwmloaden.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x151">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1LD" edc:mask="0x1" edc:name="MPWM1LD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2LD" edc:mask="0x1" edc:name="MPWM2LD" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="PWMEN" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="PWMEN" edc:nzwidth="8" edc:por="------00" edc:_modsrc="DOS-03855_pwm_cmp_v1_pwmloaden.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x2" edc:_addr="0x152">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="MPWM1EN" edc:mask="0x1" edc:name="MPWM1EN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="MPWM2EN" edc:mask="0x1" edc:name="MPWM2EN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----nnnn" edc:cname="PWM1ERS" edc:desc="" edc:impl="0xf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000" edc:name="PWM1ERS" edc:nzwidth="8" edc:por="----0000" edc:_modsrc="DOS-03855_pwm_cmp_v1_1Slice.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xf" edc:_addr="0x153">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ERS" edc:mask="0xf" edc:name="ERS" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="ERS0" edc:mask="0x1" edc:name="ERS0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS1" edc:mask="0x1" edc:name="ERS1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS2" edc:mask="0x1" edc:name="ERS2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERS3" edc:mask="0x1" edc:name="ERS3" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
