garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="U1BRGH" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1BD">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0xff" edc:name="BRGH" edc:nzwidth="8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnrrrrr" edc:cname="U1FIFO" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00101110" edc:name="U1FIFO" edc:nzwidth="8" edc:por="00101110" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x10" edc:_addr="0x1BE">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXBF" edc:desc="" edc:mask="0x1" edc:name="RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBE" edc:desc="" edc:mask="0x1" edc:name="RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="XON" edc:desc="" edc:mask="0x1" edc:name="XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXIDL" edc:desc="" edc:mask="0x1" edc:name="RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBF" edc:desc="" edc:mask="0x1" edc:name="TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXBE" edc:desc="" edc:mask="0x1" edc:name="TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="STPMD" edc:desc="" edc:mask="0x1" edc:name="STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXWRE" edc:desc="" edc:mask="0x1" edc:name="TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1RXBF" edc:desc="" edc:mask="0x1" edc:name="U1RXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBE" edc:desc="" edc:mask="0x1" edc:name="U1RXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1XON" edc:desc="" edc:mask="0x1" edc:name="U1XON" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXIDL" edc:desc="" edc:mask="0x1" edc:name="U1RXIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXBF" edc:desc="" edc:mask="0x1" edc:name="U1TXBF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXBE" edc:desc="" edc:mask="0x1" edc:name="U1TXBE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1STPMD" edc:desc="" edc:mask="0x1" edc:name="U1STPMD" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXWRE" edc:desc="" edc:mask="0x1" edc:name="U1TXWRE" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="U1RCIDL" edc:mask="0x1" edc:name="U1RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.2">
              <edc:AdjustPoint edc:offset="0x3"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="0x1" edc:_addr="0x1BF"/>
        <edc:SFRDef edc:access="nn---n--" edc:cname="U1UIR" edc:desc="" edc:impl="0xc4" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00---0--" edc:name="U1UIR" edc:nzwidth="8" edc:por="00---0--" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x13" edc:_addr="0x1C0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ABDIE" edc:desc="" edc:mask="0x1" edc:name="ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ABDIF" edc:desc="" edc:mask="0x1" edc:name="ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUIF" edc:desc="" edc:mask="0x1" edc:name="WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="U1ABDIE" edc:desc="" edc:mask="0x1" edc:name="U1ABDIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="U1ABDIF" edc:desc="" edc:mask="0x1" edc:name="U1ABDIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1WUIF" edc:desc="" edc:mask="0x1" edc:name="U1WUIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="U1ERRIR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="10000000" edc:name="U1ERRIR" edc:nzwidth="8" edc:por="10000000" edc:_modsrc="DOS-03076_uart_protocol_0_v1.Module" edc:_refcount="2" edc:_begin="0x10" edc:_end="0x13" edc:_addr="0x1C1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TXCIF" edc:desc="" edc:mask="0x1" edc:name="TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXFOIF" edc:desc="" edc:mask="0x1" edc:name="RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXBKIF" edc:desc="" edc:mask="0x1" edc:name="RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERIF" edc:desc="" edc:mask="0x1" edc:name="FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CERIF" edc:desc="" edc:mask="0x1" edc:name="CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PERIF" edc:desc="" edc:mask="0x1" edc:name="PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXMTIF" edc:desc="" edc:mask="0x1" edc:name="TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="U1TXCIF" edc:desc="" edc:mask="0x1" edc:name="U1TXCIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXFOIF" edc:desc="" edc:mask="0x1" edc:name="U1RXFOIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1RXBKIF" edc:desc="" edc:mask="0x1" edc:name="U1RXBKIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1FERIF" edc:desc="" edc:mask="0x1" edc:name="U1FERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1CERIF" edc:desc="" edc:mask="0x1" edc:name="U1CERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1ABDOVF" edc:desc="" edc:mask="0x1" edc:name="U1ABDOVF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1PERIF" edc:desc="" edc:mask="0x1" edc:name="U1PERIF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="U1TXMTIF" edc:desc="" edc:mask="0x1" edc:name="U1TXMTIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
