garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:JoinedSFRDef edc:cname="IVTBASE" edc:desc="" edc:name="IVTBASE" edc:nzwidth="0x18" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x466">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IVTBASE" edc:desc="" edc:islanghidden="true" edc:mask="0x1fffff" edc:name="IVTBASE" edc:nzwidth="21"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="" edc:stimtype="Record"/>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTBASEL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IVTBASEL" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x466">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTBASEL" edc:desc="" edc:mask="0xff" edc:name="IVTBASEL" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IVTBASEH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IVTBASEH" edc:nzwidth="0x8" edc:por="00000000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x467">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTBASEH" edc:desc="" edc:mask="0xff" edc:name="IVTBASEH" edc:nzwidth="0x8"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
          <edc:SFRDef edc:access="---nnnnn" edc:cname="IVTBASEU" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="IVTBASEU" edc:nzwidth="0x8" edc:por="---00000" edc:_modsrc="DOS-03056_int_8bit_v2_Q20.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x9" edc:_addr="0x468">
            <edc:AliasList/>
            <edc:SFRModeList>
              <edc:SFRMode edc:id="DS.0">
                <edc:SFRFieldDef edc:cname="IVTBASEU" edc:desc="" edc:mask="0x1f" edc:name="IVTBASEU" edc:nzwidth="5"/>
              </edc:SFRMode>
            </edc:SFRModeList>
            <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
          </edc:SFRDef>
        </edc:JoinedSFRDef>
        <edc:SFRDef edc:access="nnnnnrnn" edc:cname="PIR0" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR0" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x469">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SWIF" edc:mask="0x1" edc:name="SWIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT0IF" edc:mask="0x1" edc:name="INT0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT1IF" edc:mask="0x1" edc:name="INT1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="INT2IF" edc:mask="0x1" edc:name="INT2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1SCNTIF" edc:mask="0x1" edc:name="DMA1SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1DCNTIF" edc:mask="0x1" edc:name="DMA1DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1ORIF" edc:mask="0x1" edc:name="DMA1ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA1AIF" edc:mask="0x1" edc:name="DMA1AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR1" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46A">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA2SCNTIF" edc:mask="0x1" edc:name="DMA2SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2DCNTIF" edc:mask="0x1" edc:name="DMA2DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2ORIF" edc:mask="0x1" edc:name="DMA2ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA2AIF" edc:mask="0x1" edc:name="DMA2AIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3SCNTIF" edc:mask="0x1" edc:name="DMA3SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3DCNTIF" edc:mask="0x1" edc:name="DMA3DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3ORIF" edc:mask="0x1" edc:name="DMA3ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA3AIF" edc:mask="0x1" edc:name="DMA3AIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR2" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46B">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA4SCNTIF" edc:mask="0x1" edc:name="DMA4SCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIF" edc:mask="0x1" edc:name="DMA4DCNTIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIF" edc:mask="0x1" edc:name="DMA4ORIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIF" edc:mask="0x1" edc:name="DMA4AIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIF" edc:mask="0x1" edc:name="NVMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIF" edc:mask="0x1" edc:name="CRCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIF" edc:mask="0x1" edc:name="SCANIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIF" edc:mask="0x1" edc:name="ACTIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="PIR3" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="PIR3" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46C">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSWIF" edc:mask="0x1" edc:name="CSWIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIF" edc:mask="0x1" edc:name="OSFIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO2IF" edc:mask="0x1" edc:name="VDDIO2IF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCIF" edc:mask="0x1" edc:name="IOCIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IF" edc:mask="0x1" edc:name="TMR0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IF" edc:mask="0x1" edc:name="TMR1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIF" edc:mask="0x1" edc:name="TMR1GIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46D">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2IF" edc:mask="0x1" edc:name="TMR2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IF" edc:mask="0x1" edc:name="TMR4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIF" edc:mask="0x1" edc:name="TU16AIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIF" edc:mask="0x1" edc:name="TU16BIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IF" edc:mask="0x1" edc:name="CCP1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IF" edc:mask="0x1" edc:name="CCP2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIF" edc:mask="0x1" edc:name="PWM1PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IF" edc:mask="0x1" edc:name="PWM1IF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u0000000" edc:name="PIR5" edc:nzwidth="8" edc:por="x0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46E">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2PIF" edc:mask="0x1" edc:name="PWM2PIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IF" edc:mask="0x1" edc:name="PWM2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IF" edc:mask="0x1" edc:name="CWG1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IF" edc:mask="0x1" edc:name="CLC1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IF" edc:mask="0x1" edc:name="CLC2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3IF" edc:mask="0x1" edc:name="CLC3IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IF" edc:mask="0x1" edc:name="CLC4IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIF" edc:mask="0x1" edc:name="IOCSRIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="PIR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x46F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIF" edc:mask="0x1" edc:name="U1RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIF" edc:mask="0x1" edc:name="U1TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IF" edc:mask="0x1" edc:name="U1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIF" edc:mask="0x1" edc:name="U1EIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIF" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIF" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IF" edc:mask="0x1" edc:name="U2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIF" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
