garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR2" edc:desc="" edc:impl="0xe" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR2" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x47F">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DMA4SCNTIP" edc:mask="0x1" edc:name="DMA4SCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4DCNTIP" edc:mask="0x1" edc:name="DMA4DCNTIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4ORIP" edc:mask="0x1" edc:name="DMA4ORIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DMA4AIP" edc:mask="0x1" edc:name="DMA4AIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="NVMIP" edc:mask="0x1" edc:name="NVMIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CRCIP" edc:mask="0x1" edc:name="CRCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SCANIP" edc:mask="0x1" edc:name="SCANIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ACTIP" edc:mask="0x1" edc:name="ACTIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnn-nnn" edc:cname="IPR3" edc:desc="" edc:impl="0xf7" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000-000" edc:name="IPR3" edc:nzwidth="8" edc:por="0000-000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x480">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CSWIP" edc:mask="0x1" edc:name="CSWIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OSFIP" edc:mask="0x1" edc:name="OSFIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="VDDIO2IP" edc:mask="0x1" edc:name="VDDIO2IP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IOCIP" edc:mask="0x1" edc:name="IOCIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR0IP" edc:mask="0x1" edc:name="TMR0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1IP" edc:mask="0x1" edc:name="TMR1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR1GIP" edc:mask="0x1" edc:name="TMR1GIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR4" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x481">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TMR2IP" edc:mask="0x1" edc:name="TMR2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TMR4IP" edc:mask="0x1" edc:name="TMR4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16AIP" edc:mask="0x1" edc:name="TU16AIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TU16BIP" edc:mask="0x1" edc:name="TU16BIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP1IP" edc:mask="0x1" edc:name="CCP1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CCP2IP" edc:mask="0x1" edc:name="CCP2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1PIP" edc:mask="0x1" edc:name="PWM1PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM1IP" edc:mask="0x1" edc:name="PWM1IP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="u0000000" edc:name="IPR5" edc:nzwidth="8" edc:por="x0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x482">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PWM2PIP" edc:mask="0x1" edc:name="PWM2PIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PWM2IP" edc:mask="0x1" edc:name="PWM2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CWG1IP" edc:mask="0x1" edc:name="CWG1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC1IP" edc:mask="0x1" edc:name="CLC1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC2IP" edc:mask="0x1" edc:name="CLC2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC3IP" edc:mask="0x1" edc:name="CLC3IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CLC4IP" edc:mask="0x1" edc:name="CLC4IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IOCSRIP" edc:mask="0x1" edc:name="IOCSRIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="IPR6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IPR6" edc:nzwidth="8" edc:por="00000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x483">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="U1RXIP" edc:mask="0x1" edc:name="U1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1TXIP" edc:mask="0x1" edc:name="U1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1IP" edc:mask="0x1" edc:name="U1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U1EIP" edc:mask="0x1" edc:name="U1EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2RXIP" edc:mask="0x1" edc:name="U2RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2TXIP" edc:mask="0x1" edc:name="U2TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2IP" edc:mask="0x1" edc:name="U2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="U2EIP" edc:mask="0x1" edc:name="U2EIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
