garyPenhook/PIC-Assembler/edc/PIC18F05Q20.PIC
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="IPR7" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0000000" edc:name="IPR7" edc:nzwidth="8" edc:por="-0000000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x484">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SPI1RXIP" edc:mask="0x1" edc:name="SPI1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1TXIP" edc:mask="0x1" edc:name="SPI1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPI1IP" edc:mask="0x1" edc:name="SPI1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1RXIP" edc:mask="0x1" edc:name="I2C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1TXIP" edc:mask="0x1" edc:name="I2C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1IP" edc:mask="0x1" edc:name="I2C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I2C1EIP" edc:mask="0x1" edc:name="I2C1EIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="---rrrrr" edc:cname="IPR8" edc:desc="" edc:impl="0x1f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000" edc:name="IPR8" edc:nzwidth="8" edc:por="---00000" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x485">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="I3C1RXIP" edc:mask="0x1" edc:name="I3C1RXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1TXIP" edc:mask="0x1" edc:name="I3C1TXIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1IP" edc:mask="0x1" edc:name="I3C1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1EIP" edc:mask="0x1" edc:name="I3C1EIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="I3C1RIP" edc:mask="0x1" edc:name="I3C1RIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-----" edc:cname="IPR9" edc:desc="" edc:impl="0xe0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000-----" edc:name="IPR9" edc:nzwidth="8" edc:por="000-----" edc:_modsrc="DOS-xxxx_Interrupts_Q20_8bit.Module" edc:_refcount="3" edc:_begin="0x0" edc:_end="0xa" edc:_addr="0x486">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="HLVDIP" edc:mask="0x1" edc:name="HLVDIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADIP" edc:mask="0x1" edc:name="ADIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADTIP" edc:mask="0x1" edc:name="ADTIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnrnnn" edc:cname="PORTA" edc:desc="" edc:impl="0x3f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--uuuuuu" edc:name="PORTA" edc:nzwidth="0x8" edc:por="--xxxxxx" edc:_modsrc="DOS-PORTx_8bit_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x487">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RA0" edc:desc="" edc:mask="0x1" edc:name="RA0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA1" edc:desc="" edc:mask="0x1" edc:name="RA1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA2" edc:desc="" edc:mask="0x1" edc:name="RA2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA3" edc:desc="" edc:mask="0x1" edc:name="RA3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA4" edc:desc="" edc:mask="0x1" edc:name="RA4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RA5" edc:desc="" edc:mask="0x1" edc:name="RA5" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="1" edc:_addr="0x488"/>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="PORTC" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="PORTC" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_modsrc="DOS-PORTx_8bit_v2.Module" edc:_refcount="1" edc:_begin="0x0" edc:_end="0x12" edc:_addr="0x489">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RC0" edc:desc="" edc:mask="0x1" edc:name="RC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC1" edc:desc="" edc:mask="0x1" edc:name="RC1" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RC3" edc:desc="" edc:mask="0x1" edc:name="RC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC4" edc:desc="" edc:mask="0x1" edc:name="RC4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC5" edc:desc="" edc:mask="0x1" edc:name="RC5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC6" edc:desc="" edc:mask="0x1" edc:name="RC6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RC7" edc:desc="" edc:mask="0x1" edc:name="RC7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
